tap "azure/functions"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "stripe/stripe-cli"
tap "tilt-dev/tap"
tap "wix/brew"
brew "aichat"
brew "asciinema"
brew "aws-iam-authenticator"
brew "awscli"
brew "bat"
brew "bitrise"
brew "btop"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "docker", link: false
brew "docutils"
brew "dos2unix"
brew "duf"
brew "dust"
brew "editorconfig"
brew "eye-d3"
brew "eza"
brew "fd"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-delta"
brew "go"
brew "gron"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "htop"
brew "hurl"
brew "icu4c@76"
brew "imagemagick"
brew "iperf3"
brew "jj"
brew "jq"
brew "k6"
brew "k9s"
brew "kind"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "libraqm"
brew "lnav"
brew "mdf2iso"
brew "mkcert"
brew "multi-gitter"
brew "neofetch"
brew "neovim"
brew "node"
brew "nss"
brew "nvm"
brew "openssl@1.1"
brew "oxipng"
brew "p7zip"
brew "pgcli"
brew "pillow"
brew "pipx"
brew "pkgconf"
brew "pngquant"
brew "pnpm"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "protobuf"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "repomix"
brew "ripgrep"
brew "sd"
brew "shfmt"
brew "starship"
brew "swift-format"
brew "switchaudio-osx"
brew "tcl-tk"
brew "tctl"
brew "tealdeer"
brew "temporal"
brew "tree"
brew "watch"
brew "wget"
brew "xcodegen"
brew "yadm"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "azure/functions/azure-functions-core-tools@4"
brew "felixkratz/formulae/borders"
brew "hashicorp/tap/terraform"
brew "qmk/qmk/qmk"
brew "stripe/stripe-cli/stripe"
brew "tilt-dev/tap/tilt"
brew "wix/brew/applesimutils"
cask "alt-tab"
cask "amazon-q"
cask "aws-vault-binary"
cask "blackhole-2ch"
cask "cyberduck"
cask "deskpad"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "easy-move+resize"
cask "fig"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "hiddenbar"
cask "jdownloader"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keycastr"
cask "maccy"
cask "meetingbar"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "modern-csv"
cask "neovide-app"
cask "orbstack"
cask "pop-app"
cask "postman"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "scoot"
cask "slack"
cask "soundanchor"
cask "stats"
cask "syntax-highlight"
cask "via"
cask "vial"
cask "visual-studio-code"
cask "webstorm"
cask "zappy"
cask "zoom"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "connor4312.esbuild-problem-matchers"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "krizzdewizz.refactorix"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "paulchiu.saucer"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "reduckted.vscode-gitweblinks"
vscode "rooveterinaryinc.roo-cline"
vscode "spadin.zmk-tools"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tilt-dev.tiltfile"
vscode "tomoki1207.pdf"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
