tap "argoproj/tap"
tap "codecrafters-io/tap"
tap "federico-terzi/espanso"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sandreas/tap"
tap "spicetify/tap"
tap "tilt-dev/tap"
brew "aws-iam-authenticator"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "gcc"
brew "btop"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "docker", link: false
brew "docutils"
brew "dos2unix"
brew "editorconfig"
brew "fd"
brew "fzf"
brew "gh"
brew "gitui"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "go"
brew "gron"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "htop"
brew "hurl"
brew "istioctl"
brew "jq"
brew "k6"
brew "k9s"
brew "kind"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "libraqm"
brew "lnav"
brew "mdf2iso"
brew "mkcert"
brew "neofetch"
brew "nss"
brew "nvm"
brew "openssl@1.1"
brew "p7zip"
brew "tcl-tk"
brew "pillow"
brew "pnpm"
brew "postgresql@14"
brew "protobuf"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "shfmt"
brew "spotify-tui"
brew "srt"
brew "starship"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "z"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
brew "qmk/qmk/qmk"
brew "sandreas/tap/m4b-tool"
brew "spicetify/tap/spicetify-cli"
brew "tilt-dev/tap/tilt"
cask "alt-tab"
cask "aws-vault"
cask "cyberduck"
cask "discord"
cask "docker"
cask "dropbox"
cask "easy-move-plus-resize"
cask "fig"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "hiddenbar"
cask "iterm2"
cask "jdownloader"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "maccy"
cask "macvim"
cask "meetingbar"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "modern-csv"
cask "ngrok"
cask "orbstack"
cask "paw"
cask "pop"
cask "postman"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "shortcat"
cask "slack"
cask "stats"
cask "syntax-highlight"
cask "via"
cask "visual-studio-code"
cask "webstorm"
cask "wombat"
cask "zappy"
cask "zoom"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-markdown"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "orta.vscode-jest"
vscode "pollywoggames.pico8-ls"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "spadin.zmk-tools"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.vscode-open-in-github"
vscode "tilt-dev.tiltfile"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
